---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPath.ShowDownText
source: html/03c126de-1985-bb64-28b3-cc4c3c391591.htm
---
# Autodesk.Revit.DB.Architecture.StairsPath.ShowDownText Property

Represents whether show stairs down text or not.

## Syntax (C#)
```csharp
public bool ShowDownText { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The type of this stairs path is not automatic up/down direction.